#+latex_class_options: [fleqn, parskip=full]
#+latex_header: \usepackage{homework}

#+title: EE341 Fall 2019 HW \jobname
#+author: Lewis Collum
#+date: Updated: \today
[[https://github.com/LewisCollum/microelectronics][github.com/LewisCollum/microelectronics]]

*** Solve for $I_{D[0]}$ from diode characteristic equation
#+BEGIN_EXPORT latex
\noindent
\[I_{D[0]} = I_S\cdot e^{V_{D[0]}/V_T}\]
#+END_EXPORT

#+ATTR_LATEX: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session s435
i['D'].append((i['S']*numpy.exp(v['D'][0] / v['T'])).to('mA'))
print("\\noindent\\[I_{D[0]} =", f"{i['D'][0]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[0]} = \SI[]{14.5}{\milli\ampere}\]
#+END_EXPORT

*** Solve for $I_{D[1]}$ by KVL
#+BEGIN_EXPORT latex
\noindent\[V_{DD} = I_D R + V_D\]
\[\text{So, } I_D = \frac{V_{DD} - V_D}{R}\]
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session s435
i['D'].append(((v['DD'] - v['D'][0])/R).to('mA'))
print("\\noindent\\[I_{D[1]} =", f"{i['D'][1]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[1]} = \SI[]{0.3}{\milli\ampere}\]
#+END_EXPORT

*** Iterative solution for $V_D$ and $I_D$
#+BEGIN_EXPORT latex
\begin{equation*}
  V_{D[n]} - V_{D[n-1]} = V_T \ln{\frac{I_{D[n]}}{I_{D[n-1]}}}
\end{equation*}
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output table :session s435
iterations = 7

table = [["Iteration", "$V_D$ (V)", "$I_D$ (mA)"],
         [0, f"{v['D'][0].magnitude:.6}", f"{i['D'][0].magnitude:.6}"]]

for n in range(1, iterations+1):
    v['D'].append(v['D'][n-1] + v['T']*numpy.log(i['D'][n]/i['D'][n-1]))
    table.append([n, f"{v['D'][n].magnitude:.6}", f"{i['D'][n].magnitude:.6}"])
    i['D'].append(((v['DD'] - v['D'][n])/R).to('mA'))

print(table)
#+END_SRC

#+RESULTS:
| Iteration | $V_D$ (V)  | $I_D$ (mA)  |
|         0 | 0.7 V      | 14.4626 mA  |
|         1 | 0.603112 V | 0.3 mA      |
|         2 | 0.610108 V | 0.396888 mA |
|         3 | 0.609664 V | 0.389892 mA |
|         4 | 0.609692 V | 0.390336 mA |
|         5 | 0.603112 V | 0.390308 mA |
|         6 | 0.610108 V | 0.396888 mA |
|         7 | 0.609664 V | 0.389892 mA |
|         8 | 0.609692 V | 0.390336 mA |
|         9 | 0.603112 V | 0.390308 mA |
|        10 | 0.610108 V | 0.396888 mA |

*** Solve for $I_S$

Finding the saturation current using the characteristic diode equation
allows us to use the equation again to solve for the current of the circuit
with a different voltage across the diodes.

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output latex :exports both :session s437
i['S'] = i['D'][0]*math.exp(-v['D'][0]/v['T'])
api.printEquation("I_S", i['S'], 4)
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_S = \SI[]{9.358e-14}{\milli\ampere}\]
#+END_EXPORT

*** Solve for \(V_{D[1]}\) and \(I_{D[1]}\)

The output voltage, \(V_O\), must be split among the diodes in
series. Once we have the voltage drop for each diode, we find the
corresponding current using the characteristic diode equation.

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output latex :exports both :session s437
v['D'].append(v['O']/diodeCount)
i['D'].append(i['S']*math.exp(v['D'][1]/v['T']))
api.printEquation("V_{D[1]}", v['D'][1], 4)
api.printEquation("I_{D[1]}", i['D'][1], 4)
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[V_{D[1]} = \SI[]{0.825}{\volt}\]
\noindent\[I_{D[1]} = \SI[]{20.09}{\milli\ampere}\]
#+END_EXPORT

*** Solve for R

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output latex :exports both :session s437
R = ((v['DD'] - v['O'])/i['D'][1]).to('ohm')
api.printBoxedEquation("R", R, 4)
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[\boxed{ R = \SI[]{582.5}{\ohm} }\]
#+END_EXPORT

*** Solve for \(I_{D1}\), \(I_{D2}\), \(V_A\), \(V_B\)
#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output latex :exports both
import api.homework_2 as api
from api.homework_2 import Node, Branch
unit = api.unit

node = {
    'ground': Node(0*unit.V),
    'C': Node.fromVoltage(10*unit.V),
    'D': Node.fromVoltage(-10*unit.V),
}

branch = {
    'D1': Branch.fromVoltage(0.7*unit.V),
    'D2': Branch.fromVoltage(0.7*unit.V),
}

node['B'] = Node.fromNodeBranch(node['ground'], branch['D1'])
node['A'] = Node.toBranchNode(branch['D2'], node['B'])

branch['BD'] = Branch.fromNodeToNode(node['B'], node['D'])
branch['CA'] = Branch.fromNodeToNode(node['C'], node['A'])
branch['CB'] = branch['CA'].swallowBranch(branch['D2'])

branch['BD'].setCurrentFromResistance(5*unit.kohm)
branch['CB'].setCurrentFromResistance(10*unit.kohm)
branch['D1'].setCurrentTowardsBranches(-branch['CB'], branch['BD'])

api.printBoxedEquation("I_{D1}", branch['D1'].current.to('mA'), 3)
api.printBoxedEquation("I_{D2}", branch['CB'].current.to('mA'), 3)
api.printBoxedEquation("V_A", node['A'].voltage, 3)
api.printBoxedEquation("V_B", node['B'].voltage, 3)
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[\boxed{ I_{D1} = \SI[]{0.79}{\milli\ampere} }\]
\noindent\[\boxed{ I_{D2} = \SI[]{1.07}{\milli\ampere} }\]
\noindent\[\boxed{ V_A = \SI[]{0.0}{\volt} }\]
\noindent\[\boxed{ V_B = \SI[]{-0.7}{\volt} }\]
#+END_EXPORT

*** Assume both diodes are conducting
#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :results output latex :exports both :session s440B
import api.homework_2 as api
from api.homework_2 import Node, Branch, unit

node = {'C': Node.fromVoltage(10*unit.V), 'D': Node.fromVoltage(-10*unit.V)}
branch = {'D1': Branch.fromVoltage(0.7*unit.V), 'D2': Branch.fromVoltage(0.7*unit.V)}
node['B'] = Node.fromNodeBranch(Node(0.0*unit.V), branch['D1'])
node['A'] = Node.toBranchNode(branch['D2'], node['B'])

branch['BD'] = Branch.fromNodeToNode(node['B'], node['D'])
branch['CA'] = Branch.fromNodeToNode(node['C'], node['A'])
branch['CB'] = branch['CA'].swallowBranch(branch['D2'])

branch['CB'].setCurrentFromResistance(5*unit.kohm)
branch['BD'].setCurrentFromResistance(10*unit.kohm)
branch['D1'].setCurrentTowardsBranches(branch['BD'], -branch['CB'])

api.printEquation("I_{D1}", branch['D1'].current.to('mA'), 3)
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D1} = \SI[]{-1.21}{\milli\ampere}\]
#+END_EXPORT

D1 is not conducting when reverse-biased, so the assumption that both
diodes are conducting is wrong.

*** Solve for $I_{D[0]}$ from diode characteristic equation
#+BEGIN_EXPORT latex
\noindent
\[I_{D[0]} = I_S\cdot e^{V_{D[0]}/V_T}\]
#+END_EXPORT

#+ATTR_LATEX: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session spice
i['D'].append((i['S']*numpy.exp(v['D'][0] / (v['T']*1.1))).to('mA'))
print("\\noindent\\[I_{D[0]} =", f"{i['D'][0]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[0]} = \SI[]{0.113}{\milli\ampere}\]
#+END_EXPORT

*** Solve for $I_{D[1]}$ by KVL
#+BEGIN_EXPORT latex
\noindent\[V_{DD} = I_D R + V_D\]
\[\text{So, } I_D = \frac{V_{DD} - V_D}{R}\]
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session spice
i['D'].append(((v['DD'] - v['D'][0])/R).to('mA'))
print("\\noindent\\[I_{D[1]} =", f"{i['D'][1]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[1]} = \SI[]{0.3}{\milli\ampere}\]
#+END_EXPORT

*** Iterative solution for $V_D$ and $I_D$
#+BEGIN_EXPORT latex
\begin{equation*}
  V_{D[n]} - V_{D[n-1]} = V_T \ln{\frac{I_{D[n]}}{I_{D[n-1]}}}
\end{equation*}
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output table :session spice
iterations = 3

table = [["Iteration", "$V_D$ (V)", "$I_D$ (mA)"],
         [0, f"{v['D'][0].magnitude:.6}", f"{i['D'][0].magnitude:.6}"]]

for n in range(1, iterations+1):
    v['D'].append(v['D'][n-1] + v['T']*numpy.log(i['D'][n]/i['D'][n-1]))
    table.append([n, f"{v['D'][n].magnitude:.6}", f"{i['D'][n].magnitude:.6}"])
    i['D'].append(((v['DD'] - v['D'][n])/R).to('mA'))

print(table)
#+END_SRC

#+RESULTS:
| Iteration | $V_D$ (V) | $I_D$ (mA) |
|         0 |       0.7 |   0.113441 |
|         1 |  0.724313 |        0.3 |
|         2 |    0.7222 |   0.275687 |
|         3 |  0.722391 |     0.2778 |

*** Solve for $I_{D[0]}$ from diode characteristic equation
#+BEGIN_EXPORT latex
\noindent
\[I_{D[0]} = I_S\cdot e^{V_{D[0]}/V_T}\]
#+END_EXPORT

#+ATTR_LATEX: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session spice2
i['D'].append((i['S']*numpy.exp(v['D'][0] / v['T']/1.1)).to('mA'))
print("\\noindent\\[I_{D[0]} =", f"{i['D'][0]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[0]} = \SI[]{0.113}{\milli\ampere}\]
#+END_EXPORT

*** Solve for $I_{D[1]}$ by KVL
#+BEGIN_EXPORT latex
\noindent\[V_{DD} = I_D R + V_D\]
\[\text{So, } I_D = \frac{V_{DD} - V_D}{R}\]
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output latex :session spice2
i['D'].append(((v['DD'] - v['D'][0])/R).to('mA'))
print("\\noindent\\[I_{D[1]} =", f"{i['D'][1]:.3~Lx}\\]")
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT latex
\noindent\[I_{D[1]} = \SI[]{1.3}{\milli\ampere}\]
#+END_EXPORT

*** Iterative solution for $V_D$ and $I_D$
#+BEGIN_EXPORT latex
\begin{equation*}
  V_{D[n]} - V_{D[n-1]} = V_T \ln{\frac{I_{D[n]}}{I_{D[n-1]}}}
\end{equation*}
#+END_EXPORT

#+attr_latex: :options bgcolor=codeBackground
#+BEGIN_SRC python :exports both :results output table :session spice2
iterations = 3

table = [["Iteration", "$V_D$ (V)", "$I_D$ (mA)"],
         [0, f"{v['D'][0].magnitude:.6}", f"{i['D'][0].magnitude:.6}"]]

for n in range(1, iterations+1):
    v['D'].append(v['D'][n-1] + v['T']*numpy.log(i['D'][n]/i['D'][n-1]))
    table.append([n, f"{v['D'][n].magnitude:.6}", f"{i['D'][n].magnitude:.6}"])
    i['D'].append(((v['DD'] - v['D'][n])/R).to('mA'))

print(table)
#+END_SRC

#+RESULTS:
| Iteration | $V_D$ (V) | $I_D$ (mA) |
|         0 |       0.7 |        1.3 |
|         1 |       0.7 |        1.3 |
|         2 |       0.7 |        1.3 |
|         3 |       0.7 |        1.3 |





